package doc

/*
1. 微信小程序
2. 囡囡玩的手动设计游戏内容(装备,人物)的游戏形式
3. 提供较好上手的游戏编辑形式( 游戏中, 编辑游戏内容, 可以一遍一遍搞, 直到满意发布, 发布后要等审核才能面市)
4. 每个游戏内容, 都有独立的世界参数, 互不干扰, 完全独立可控
5. 每个游戏容纳的人数有限额, 设计者的游戏品质决定上限, 各种设计者自动宣传, 告家长书:5分钟的制作,没有浪费孩子时间, 而且激发设计能力
6. 各种图片的上传, 涉及到云存储问题
7. 龙骨应用, 各种图片被支配为动态道具(egret)
8. 客户端采用egret引擎, 确实合适
9. 每个人都可以设计多款游戏, 但是必须等前一款成功后, 才能设计下一款, 点赞还是赞助? 设计者不能赞助自己作品扩展空间, 只能是其他人赞助, 费用有上限, 有限定次数
10. 如何面对商家入驻, 商家是完全不同意义的赞助, 逼格更高, 设计要求更高, 审核难度大, 但是大家都是免费的, 官方要出免责声明
11. 设计者如何留住用户, 如何增加赞助?
12. 游戏升级, 如何保障玩家数据
13. 如何清档?
14. 永远只有一个服?
15. 需要游戏热销榜么?
16. 设计者的微信二维码等联系方式, 商家的小程序入口
17. 玩家 : 怎么玩这么多的游戏? 玩家得到什么? 消耗什么? 赞助是必须的嘛? 赞助后不能得到任何好处, 否则就变成购买, 每个游戏的积分, 评分, 评价, 就像是谁的故事讲得好...
18. 每个玩家的数据会非常杂乱, 什么游戏的内容都有, 大小各不相同, 协议的多样化很重
19. 病毒式传播设计理念, 设计者就是有力量, 争做设计先锋
20. 项目名称 : 你做我玩
21. 游戏LBS, 游戏地图理念, 小游戏串联, 地图关联
*/
